_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 71, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 34, 158, 24)       1824      
_________________________________________________________________
group_normalization_1 (Group (None, 34, 158, 24)       48        
_________________________________________________________________
activation_1 (Activation)    (None, 34, 158, 24)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 77, 36)        21636     
_________________________________________________________________
group_normalization_2 (Group (None, 15, 77, 36)        72        
_________________________________________________________________
activation_2 (Activation)    (None, 15, 77, 36)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 37, 48)         43248     
_________________________________________________________________
group_normalization_3 (Group (None, 6, 37, 48)         96        
_________________________________________________________________
activation_3 (Activation)    (None, 6, 37, 48)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 35, 64)         27712     
_________________________________________________________________
group_normalization_4 (Group (None, 4, 35, 64)         128       
_________________________________________________________________
activation_4 (Activation)    (None, 4, 35, 64)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 33, 64)         36928     
_________________________________________________________________
group_normalization_5 (Group (None, 2, 33, 64)         128       
_________________________________________________________________
activation_5 (Activation)    (None, 2, 33, 64)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4224)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               422500    
_________________________________________________________________
activation_6 (Activation)    (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
activation_7 (Activation)    (None, 50)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
activation_8 (Activation)    (None, 10)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 559,891
Trainable params: 559,891
Non-trainable params: 0
_________________________________________________________________
